axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
void ESP32CSWebServer::handleConfig(AsyncWebServerRequest *request) {
  std::vector<String> arguments;
  if(request->method() == HTTP_POST) {
    DCCPPProtocolHandler::getCommandHandler("E")->process(arguments);
  } else {
    DCCPPProtocolHandler::getCommandHandler("e")->process(arguments);
  }
}

#if S88_ENABLED
void ESP32CSWebServer::handleS88Sensors(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    JsonArray &array = jsonResponse->getRoot();
    S88BusManager::getState(array);
  } else if(request->method() == HTTP_POST) {
    if(!S88BusManager::createOrUpdateBus(
      request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_PIN_NODE).toInt(),
      request->arg(JSON_COUNT_NODE).toInt())) {
      // duplicate pin/id
      jsonResponse->setCode(STATUS_NOT_ALLOWED);
    }
  } else if(request->method() == HTTP_DELETE) {
    S88BusManager::removeBus(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}
#endif

void ESP32CSWebServer::handleRemoteSensors(AsyncWebServerRequest *request) {
  auto jsonResponse = new AsyncJsonResponse(true);
  if(request->method() == HTTP_GET) {
    JsonArray &array = jsonResponse->getRoot();
    RemoteSensorManager::getState(array);
  } else if(request->method() == HTTP_POST) {
    RemoteSensorManager::createOrUpdate(request->arg(JSON_ID_NODE).toInt(),
      request->arg(JSON_VALUE_NODE).toInt());
  } else if(request->method() == HTTP_DELETE) {
    RemoteSensorManager::remove(request->arg(JSON_ID_NODE).toInt());
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void ESP32CSWebServer::handleLocomotive(AsyncWebServerRequest *request) {
  // method - url pattern - meaning
  // ANY /locomotive/estop - send emergency stop to all locomotives
  // GET /locomotive/roster - roster
  // GET /locomotive/roster?address=<address> - get roster entry
  // PUT /locomotive/roster?address=<address> - update roster entry
  // POST /locomotive/roster?address=<address> - create roster entry
  // DELETE /locomotive/roster?address=<address> - delete roster entry
  // GET /locomotive - get active locomotives
  // POST /locomotive?address=<address> - add locomotive to active management
  // GET /locomotive?address=<address> - get locomotive state
  // PUT /locomotive?address=<address>&speed=<speed>&dir=[FWD|REV]&fX=[true|false] - Update locomotive state, fX is short for function X where X is 0-28.
  // DELETE /locomotive?address=<address> - removes locomotive from active management
  const String url = request->url();
  auto jsonResponse = new AsyncJsonResponse(request->method() == HTTP_GET && !request->params());
  jsonResponse->setCode(STATUS_OK);
  // check if we have an eStop command, we don't care how this gets sent to the
  // command station (method) so check it first
  if(url.endsWith("/estop")) {
    LocomotiveManager::emergencyStop();
  } else if(url.indexOf("/roster") > 0) {
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE)) {
      LocomotiveManager::getRosterEntries(jsonResponse->getRoot());
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      if(request->method() == HTTP_DELETE) {
        LocomotiveManager::removeRosterEntry(request->arg(JSON_ADDRESS_NODE).toInt());
      } else {
        RosterEntry *entry = LocomotiveManager::getRosterEntry(request->arg(JSON_ADDRESS_NODE).toInt());
        if(request->method() == HTTP_PUT || request->method() == HTTP_POST) {
          if(request->hasArg(JSON_DESCRIPTION_NODE)) {
            entry->setDescription(request->arg(JSON_DESCRIPTION_NODE));
          }
          if(request->hasArg(JSON_TYPE_NODE)) {
            entry->setType(request->arg(JSON_TYPE_NODE));
          }
          if(request->hasArg(JSON_IDLE_ON_STARTUP_NODE)) {
            entry->setIdleOnStartup(request->arg(JSON_IDLE_ON_STARTUP_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
          if(request->hasArg(JSON_DEFAULT_ON_THROTTLE_NODE)) {
            entry->setDefaultOnThrottles(request->arg(JSON_DEFAULT_ON_THROTTLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
        entry->toJson(jsonResponse->getRoot());
      }
    }
  } else {
    // Since it is not an eStop or roster command we need to check the request
    // method and ensure it contains the required arguments otherwise the
    // request should be rejected
    if(request->method() == HTTP_GET && !request->hasArg(JSON_ADDRESS_NODE)) {
      // get all active locomotives
      LocomotiveManager::getActiveLocos(jsonResponse->getRoot()); 
    } else if (request->hasArg(JSON_ADDRESS_NODE)) {
      auto loco = LocomotiveManager::getLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
      if(request->method() == HTTP_PUT || request->method() == HTTP_POST) {
        // Creation / Update of active locomotive
        bool needUpdate = false;
        if(request->hasArg(JSON_IDLE_NODE) && request->arg(JSON_IDLE_NODE).equalsIgnoreCase(JSON_VALUE_TRUE)) {
          loco->setIdle();
          needUpdate = true;
        }
        if(request->hasArg(JSON_DIRECTION_NODE)) {
          loco->setDirection(request->arg(JSON_DIRECTION_NODE).equalsIgnoreCase(JSON_VALUE_FORWARD));
          needUpdate = true;
        }
        if(request->hasArg(JSON_SPEED_NODE)) {
          loco->setSpeed(request->arg(JSON_SPEED_NODE).toInt());
          needUpdate = true;
        }
        for(uint8_t funcID = 0; funcID <=28 ; funcID++) {
          String fArg = "f" + String(funcID);
          if(request->hasArg(fArg.c_str())) {
            loco->setFunction(funcID, request->arg(fArg.c_str()).equalsIgnoreCase(JSON_VALUE_TRUE));
          }
        }
        if(needUpdate) {
          loco->sendLocoUpdate(true);
          loco->showStatus();
        }
      } else if(request->method() == HTTP_DELETE) {
        // Removal of an active locomotive
        LocomotiveManager::removeLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
#if NEXTION_ENABLED
        static_cast<NextionThrottlePage *>(nextionPages[THROTTLE_PAGE])->invalidateLocomotive(request->arg(JSON_ADDRESS_NODE).toInt());
#endif
      }
      loco->toJson(jsonResponse->getRoot());
    } else {
      // missing arg or unknown request
      jsonResponse->setCode(STATUS_BAD_REQUEST);
    }
  }
  jsonResponse->setLength();
  request->send(jsonResponse);
}

void handleOTAUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
#if NEXTION_ENABLED
    nextionPages[TITLE_PAGE]->show();
    static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(0, "Firmware Upload Started...");
#endif
    otaInProgress = true;
    LOG(INFO, "Update starting...");
    InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Update starting");
    MotorBoardManager::powerOffAll();
    stopDCCSignalGenerators();
    if (!Update.begin(UPDATE_SIZE_UNKNOWN, U_FLASH)) {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, _err2str(Update.getError()));
#endif
      InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, _err2str(Update.getError()));
      request->send(STATUS_BAD_REQUEST, "text/plain", _err2str(Update.getError()));
      Update.printError(Serial);
    }
  }
  if (Update.write(data, len) != len) {
#if NEXTION_ENABLED
    static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, _err2str(Update.getError()));
#endif
    InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, _err2str(Update.getError()));
    request->send(STATUS_BAD_REQUEST, "text/plain", _err2str(Update.getError()));
    Update.printError(Serial);
  } else {
    InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Updating: %d", Update.progress());
#if NEXTION_ENABLED
    static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, String("Progress: ") + String(Update.progress()));
#endif
  }
  if (final) {
    if (Update.end(true)) {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, "Update Complete");
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(2, "Rebooting");
#endif
      InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, "Update Complete");
      otaComplete = true;
    } else {
#if NEXTION_ENABLED
      static_cast<NextionTitlePage *>(nextionPages[TITLE_PAGE])->setStatusText(1, _err2str(Update.getError()));
#endif
      InfoScreen::replaceLine(INFO_SCREEN_STATION_INFO_LINE, _err2str(Update.getError()));
      request->send(STATUS_BAD_REQUEST, "text/plain", _err2str(Update.getError()));
      Update.printError(Serial);
    }
  }
}

