axf33480/ESP32CommandStation/src/Interfaces/WebServer.cpp
#define STREAM_RESOURCE(request, uri, mimeType, totalSize, resource) \
  if (request->url() == uri) { \
    LOG(INFO, "[WebSrv %s] Streaming %s (%d, %s)", request->client()->remoteIP().toString().c_str(), uri, totalSize, mimeType); \
    response = request->beginResponse_P(STATUS_OK, mimeType, resource, totalSize); \
  }

void ESP32CSWebServer::streamChunkedResource(AsyncWebServerRequest *request) {
  const char * htmlBuildTime = __DATE__ " " __TIME__;
  if (request->header("If-Modified-Since").equals(htmlBuildTime)) {
    request->send(STATUS_NOT_MODIFIED);
  } else {
    AsyncWebServerResponse *response = nullptr;
    STREAM_RESOURCE(request, "/index.html", "text/html", indexHtmlGz_size, indexHtmlGz)
    STREAM_RESOURCE(request, "/jquery.min.js", "text/javascript", jqueryJsGz_size, jqueryJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.js", "text/javascript", jqueryMobileJsGz_size, jqueryMobileJsGz)
    STREAM_RESOURCE(request, "/jquery.mobile-1.5.0-rc1.min.css", "text/css", jqueryMobileCssGz_size, jqueryMobileCssGz)
    STREAM_RESOURCE(request, "/jquery.simple.websocket.min.js", "text/javascript", jquerySimpleWebSocketGz_size, jquerySimpleWebSocketGz)
    STREAM_RESOURCE(request, "/jqClock-lite.min.js", "text/javascript", jqClockGz_size, jqClockGz)
    STREAM_RESOURCE(request, "/images/ajax-loader.gif", "image/gif", ajaxLoaderGz_size, ajaxLoaderGz)
    if(response) {
      response->addHeader("Content-Encoding", "gzip");
      response->addHeader("Last-Modified", htmlBuildTime);
      request->send(response);
    } else {
      request->redirect("/404");
    }
  }
}
